{
  "backend/main.mo": "Main backend actor defining all data types (Class, Session, Assignment, Grade, Attendance, Quiz, etc.) and in-memory storage maps for a learning management system with authorization, blob storage, and user approval mixins.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features related to fixing redirect logic in App.tsx, adding error handling to RoleSelectionModal.tsx, and verifying cache invalidation in useQueries.ts for proper authentication flow.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of five frontend files covering role selection modal, profile form, material card, main app routing/auth, and React Query hooks with cache management.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme color schemes including sidebar, chart, and UI component colors.",
  "frontend/index.html": "HTML entry point for the React application titled 'Way of Learning' with a root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main app component using TanStack Router for route definitions, managing authentication state, showing role selection modal for new users, and redirecting authenticated users to role-specific dashboards with debug logging.",
  "frontend/src/components/auth/RoleSelectionModal.tsx": "Modal dialog for first-time user role selection (Teacher/Student/Parent) with 10-second timeout handling, error states, retry functionality, and profile creation via mutation without page reloads.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout component with responsive header, side navigation (desktop), bottom navigation (mobile), profile avatar, logout functionality, and mobile menu sheet.",
  "frontend/src/components/layout/BottomNavigation.tsx": "Mobile bottom navigation bar that displays role-specific menu items (Home, Classes, Calendar, Messages, Profile) based on user type (teacher, student, parent, admin).",
  "frontend/src/components/layout/SideNavigation.tsx": "Desktop sidebar navigation component that renders role-specific menu items with icons, highlighting the active route and supporting navigation callbacks.",
  "frontend/src/components/parent/LinkChildModal.tsx": "Modal dialog for parents to link a child's account by entering the student's ID, with form validation and mutation handling.",
  "frontend/src/components/profile/ProfileAvatar.tsx": "Avatar component that displays user profile photo or initials fallback, supporting three size variants (sm, md, lg).",
  "frontend/src/components/profile/ProfileForm.tsx": "Form for editing user profile including name, phone, class section, and profile photo upload with progress tracking using react-hook-form.",
  "frontend/src/components/shared/AssignmentCard.tsx": "Card component displaying assignment details (title, description, due date, points) with overdue/due-soon badges and navigation to assignment details.",
  "frontend/src/components/shared/DashboardCard.tsx": "Reusable dashboard metric card with icon, title, value, and optional description, supporting four color variants (default, success, warning, info).",
  "frontend/src/components/shared/EmptyState.tsx": "Empty state component displaying title, description, optional image, and action button for when no data is available.",
  "frontend/src/components/shared/LoadingSpinner.tsx": "Animated loading spinner component with configurable size (sm, md, lg) and optional text label.",
  "frontend/src/components/shared/MaterialCard.tsx": "Card component for study materials that displays file or video link with appropriate icon and download/open action button.",
  "frontend/src/components/shared/SessionCard.tsx": "Card displaying session details (title, date, time, duration) with badges for instant/today sessions and join button for video links.",
  "frontend/src/components/student/ClassEnrollmentModal.tsx": "Modal dialog for students to enroll in a class by entering an enrollment code provided by their teacher.",
  "frontend/src/components/student/StudentClassCard.tsx": "Card component displaying class information for students with a button to navigate to the class detail page.",
  "frontend/src/components/teacher/AssignmentCreationModal.tsx": "Modal dialog component for teachers to create assignments with fields for title, description, due date, and max points. Submits data via useCreateAssignment hook and displays toast notifications.",
  "frontend/src/components/teacher/ClassCard.tsx": "Card component displaying class information including name, student count, and enrollment code with copy-to-clipboard functionality. Provides navigation to detailed class view.",
  "frontend/src/components/teacher/ClassCreationModal.tsx": "Modal dialog for creating new classes with name and enrollment code fields. Includes a code generator and uses useCreateClass hook for submission.",
  "frontend/src/components/teacher/MaterialUploadModal.tsx": "Tabbed modal allowing teachers to upload study materials either as files (with progress tracking) or video links. Handles file conversion to ExternalBlob and submission via useUploadStudyMaterial hook.",
  "frontend/src/components/teacher/SessionSchedulingModal.tsx": "Modal for scheduling or starting instant sessions with fields for title, date/time, duration, and optional video link. Uses useCreateSession hook and supports toggle between scheduled and instant sessions.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state. Invalidates dependent queries when actor changes and initializes access control with admin token.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle. Provides login, logout, and status tracking functionality throughout the application.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend API interactions including user profiles, classes, sessions, assignments, grades, attendance, study materials, and admin operations. Handles query caching, mutations, and invalidation logic.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors, including primary, secondary, muted, destructive, and chart color definitions.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Admin dashboard displaying user statistics (teachers, students, parents) with navigation buttons to user management and monitoring pages. Includes admin access check.",
  "frontend/src/pages/admin/MonitoringPage.tsx": "Placeholder page for platform monitoring and analytics features, currently showing an empty state.",
  "frontend/src/pages/admin/UserManagementPage.tsx": "Displays a list of all users with their names, IDs, and user types in card format for admin management.",
  "frontend/src/pages/parent/ChildDetailPage.tsx": "Placeholder page for viewing detailed progress of a specific child, extracting childId from route params.",
  "frontend/src/pages/parent/ParentDashboard.tsx": "Parent dashboard with functionality to link children accounts via modal, currently showing empty state when no children are linked.",
  "frontend/src/pages/ProfilePage.tsx": "Simple page component that renders a ProfileForm within a Card layout for user profile settings.",
  "frontend/src/pages/shared/CalendarPage.tsx": "Placeholder page for calendar view of scheduled sessions and assignments.",
  "frontend/src/pages/shared/LandingPage.tsx": "Marketing landing page with hero section, feature grid showcasing platform capabilities for teachers/students/parents, and login button using Internet Identity.",
  "frontend/src/pages/shared/MessagesPage.tsx": "Placeholder page for messaging functionality, currently showing empty state.",
  "frontend/src/pages/student/AttendancePage.tsx": "Displays student's attendance records with summary statistics (percentage, present count) and detailed list of attendance entries with status badges.",
  "frontend/src/pages/student/GradesPage.tsx": "Shows student's grades for assignments with scores and optional teacher comments in card format.",
  "frontend/src/pages/student/ProgressReportPage.tsx": "Placeholder page for student progress analytics and performance trends visualization.",
  "frontend/src/pages/student/QuizzesPage.tsx": "Placeholder page for student quizzes, currently showing empty state.",
  "frontend/src/pages/student/StudentClassDetailPage.tsx": "Displays detailed view of a single class for students with tabs for sessions, materials, and assignments. Fetches and filters class-specific data by classId from route params.",
  "frontend/src/pages/student/StudentDashboard.tsx": "Student dashboard showing overview cards (classes, sessions, assignments, grades) and enrolled classes grid. Includes modal for joining new classes via enrollment code.",
  "frontend/src/pages/teacher/AssignmentDetailPage.tsx": "Placeholder page for assignment grading interface showing assignment ID. Full grading functionality marked as coming soon.",
  "frontend/src/pages/teacher/ClassDetailPage.tsx": "Teacher's detailed class view with tabs for sessions, materials, assignments, and students. Includes modals for scheduling sessions, uploading materials, and creating assignments.",
  "frontend/src/pages/teacher/SessionDetailPage.tsx": "Placeholder page for session attendance tracking showing session ID. Full attendance interface marked as coming soon.",
  "frontend/src/pages/teacher/TeacherDashboard.tsx": "Teacher dashboard displaying overview cards (classes, sessions, assignments) and class grid. Includes modal for creating new classes.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and persisting URL parameters from both regular query strings and hash-based routing, with sessionStorage integration for parameter persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended theme for shadcn/ui components, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file documenting a web-based education platform with role-based authentication (Teacher/Student/Parent), class management, assignments, quizzes, and attendance tracking. Contains known issue where Teacher role redirect gets stuck after authentication, preventing dashboard access."
}