{
  "backend/main.mo": "Main backend actor defining all data types (Class, Session, Assignment, Quiz, Attendance, etc.) and storage maps for the educational platform with authorization, blob storage, and user approval mixins.",
  "backend/migration.mo": "Simple migration module that passes through old state unchanged for canister upgrades.",
  "feature_evidence.json": "Feature evidence report documenting implemented navigation systems, routing logic, and dashboard implementations for all user roles (Teacher, Student, Parent, Admin) with associated files and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend components including authentication, profile management, navigation, layouts, and role-specific pages with React Router integration.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark mode variables for the educational platform's warm orange/terracotta theme.",
  "frontend/index.html": "HTML entry point for the React application titled 'Way of Learning' with root div and module script reference.",
  "frontend/src/App.tsx": "Main application component with TanStack Router setup, authentication flow, role-based routing for all user types, and conditional rendering of role selection modal based on user profile state.",
  "frontend/src/components/auth/RoleSelectionModal.tsx": "Modal dialog for first-time user role selection (Teacher/Student/Parent) with timeout handling, error states, retry logic, and profile creation mutation without page reloads.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout component with responsive header, side navigation (desktop), bottom navigation (mobile), and logout functionality. Manages mobile menu state and renders child content in a scrollable main area.",
  "frontend/src/components/layout/BottomNavigation.tsx": "Mobile-only bottom navigation bar that displays role-specific menu items (teacher, student, parent, admin) with icons and active state highlighting. Fixed at bottom of viewport on small screens.",
  "frontend/src/components/layout/SideNavigation.tsx": "Desktop sidebar navigation component that renders role-specific menu items with icons and active state styling. Supports optional callback on navigation for mobile sheet closure.",
  "frontend/src/components/parent/LinkChildModal.tsx": "Modal dialog for parents to link a child's account by entering their student ID. Handles form submission with validation and displays success/error toasts.",
  "frontend/src/components/profile/ProfileAvatar.tsx": "Reusable avatar component that displays user profile photo or fallback initials/icon. Supports three size variants (sm, md, lg) and handles external blob image URLs.",
  "frontend/src/components/profile/ProfileForm.tsx": "Profile editing form with fields for name, phone, class/section, and profile photo upload. Handles file upload with progress tracking and saves user profile data with toast notifications.",
  "frontend/src/components/shared/AssignmentCard.tsx": "Card component displaying assignment details including title, description, due date, points, and status badges (overdue/due soon). Provides navigation to assignment detail view.",
  "frontend/src/components/shared/DashboardCard.tsx": "Reusable dashboard metric card with icon, title, value, and optional description. Supports four color variants (default, success, warning, info) for visual differentiation.",
  "frontend/src/components/shared/EmptyState.tsx": "Generic empty state component displaying title, description, optional image, and action button. Used for showing placeholder content when data is unavailable.",
  "frontend/src/components/shared/LoadingSpinner.tsx": "Animated loading spinner component with configurable size (sm, md, lg) and optional text label. Uses Lucide's Loader2 icon with rotation animation.",
  "frontend/src/components/shared/MaterialCard.tsx": "Card component for displaying study materials (files or video links) with appropriate icons and action buttons for downloading files or opening external links.",
  "frontend/src/components/shared/SessionCard.tsx": "Displays a session card with title, date/time, duration, and optional video link. Shows badges for instant sessions and today's sessions, with a button to join via video link.",
  "frontend/src/components/student/ClassEnrollmentModal.tsx": "Modal dialog for students to join a class by entering an enrollment code. Handles form submission and displays success/error toasts.",
  "frontend/src/components/student/StudentClassCard.tsx": "Card component displaying a class for students with the class name and a button to navigate to the class detail page.",
  "frontend/src/components/teacher/AssignmentCreationModal.tsx": "Modal form for teachers to create assignments with title, description, due date, and max points. Converts dates to BigInt nanoseconds for backend storage.",
  "frontend/src/components/teacher/ClassCard.tsx": "Card component for teachers showing class name, student count, and enrollment code with copy-to-clipboard functionality. Includes navigation to class detail page.",
  "frontend/src/components/teacher/ClassCreationModal.tsx": "Modal form for teachers to create a new class with name and enrollment code. Includes a code generator that creates random 6-character uppercase codes.",
  "frontend/src/components/teacher/MaterialUploadModal.tsx": "Tabbed modal allowing teachers to upload study materials either as files (with upload progress tracking) or as video links. Handles file conversion to ExternalBlob for backend storage.",
  "frontend/src/components/teacher/SessionSchedulingModal.tsx": "Modal form for teachers to schedule or start instant sessions with title, date/time, duration, and optional video link. Converts timestamps to BigInt nanoseconds.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor with Internet Identity authentication. Initializes access control with admin token and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend API operations including user profiles, classes, sessions, assignments, grades, attendance, study materials, messages, and admin functions.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors, including primary, secondary, muted, destructive, and chart color definitions.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/admin/AdminDashboard.tsx": "Admin dashboard showing user statistics (teachers, students, parents) with navigation cards to user management and platform monitoring pages.",
  "frontend/src/pages/admin/MonitoringPage.tsx": "Placeholder page for platform monitoring and analytics features that are coming soon.",
  "frontend/src/pages/admin/UserManagementPage.tsx": "Displays a list of all users with their names, IDs, and user types in card format for admin management.",
  "frontend/src/pages/parent/ChildDetailPage.tsx": "Placeholder page for viewing detailed progress information for a specific child, identified by childId route parameter.",
  "frontend/src/pages/parent/ChildrenPage.tsx": "Displays an empty state prompting parents to link their children's accounts to monitor their progress.",
  "frontend/src/pages/parent/ParentDashboard.tsx": "Parent dashboard with a button to open LinkChildModal for linking children's accounts, showing empty state when no children are linked.",
  "frontend/src/pages/ProfilePage.tsx": "Displays a card containing the ProfileForm component for users to edit their profile settings.",
  "frontend/src/pages/shared/ApprovalRequestPage.tsx": "Displays account approval status and allows users to request approval from administrators, showing pending, approved, or request states.",
  "frontend/src/pages/shared/CalendarPage.tsx": "Displays upcoming sessions and assignment due dates in chronological order, combining events from both sources into a unified calendar view.",
  "frontend/src/pages/shared/DiscussionsPage.tsx": "Placeholder page for discussion forums feature that is currently under development.",
  "frontend/src/pages/shared/LandingPage.tsx": "Landing page component displaying hero section with login button, feature cards for teachers/students/parents, and footer with branding. Uses Internet Identity authentication hook.",
  "frontend/src/pages/shared/MessagesPage.tsx": "Messaging interface allowing users to send messages by receiver ID and view received messages with timestamps. Includes form validation and toast notifications.",
  "frontend/src/pages/student/AssignmentsPage.tsx": "Student view displaying all assignments with title, description, due date, max points, and past-due status badges. Shows empty state when no assignments exist.",
  "frontend/src/pages/student/AttendancePage.tsx": "Student attendance dashboard showing attendance percentage summary and detailed records with present/late/absent status icons and dates. Displays empty state when no records exist.",
  "frontend/src/pages/student/GradesPage.tsx": "Student grades view listing graded assignments with scores and optional teacher comments. Shows empty state when no grades are available.",
  "frontend/src/pages/student/MaterialsPage.tsx": "Student page displaying study materials in a grid layout using MaterialCard components. Shows empty state when no materials are uploaded.",
  "frontend/src/pages/student/ProgressReportPage.tsx": "Placeholder page for future progress analytics feature, currently showing only an empty state with coming soon message.",
  "frontend/src/pages/student/QuizzesPage.tsx": "Placeholder page for quizzes feature, currently showing only an empty state indicating no quizzes are available.",
  "frontend/src/pages/student/StudentClassDetailPage.tsx": "Detailed class view with tabs for sessions, materials, and assignments filtered by class ID. Displays appropriate empty states for each tab when no content exists.",
  "frontend/src/pages/student/StudentDashboard.tsx": "Student dashboard page displaying enrolled classes, upcoming sessions, pending assignments, and average grade with a modal to join new classes via enrollment code.",
  "frontend/src/pages/teacher/AssignmentDetailPage.tsx": "Assignment detail page for teachers showing assignment ID with placeholder for future grading interface functionality.",
  "frontend/src/pages/teacher/ClassDetailPage.tsx": "Teacher class detail page with tabs for sessions, materials, assignments, and students, including modals for scheduling sessions, uploading materials, and creating assignments.",
  "frontend/src/pages/teacher/MaterialsPage.tsx": "Teacher materials page displaying all study materials across classes with loading and empty states.",
  "frontend/src/pages/teacher/QuizzesPage.tsx": "Placeholder page for quiz management feature showing an empty state indicating the feature is under development.",
  "frontend/src/pages/teacher/SessionDetailPage.tsx": "Session detail page for teachers showing session ID with placeholder for future attendance tracking interface.",
  "frontend/src/pages/teacher/TeacherDashboard.tsx": "Teacher dashboard page displaying created classes, upcoming sessions, and active assignments with a modal to create new classes.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters and sessionStorage values, supporting both regular and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended theme settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file defining an educational platform with 4 user roles (Teacher, Student, Parent, Admin) featuring messaging, attendance, assignments, quizzes, materials, discussions, and calendar. Built with Motoko backend, React/TypeScript frontend, Internet Identity authentication, and includes 11 existing features covering navigation, dashboards, and core educational functionality."
}